In [ ]:
! pip install ipython-sql 
import sqlite3
import pandas as pd
from sqlalchemy import *
from gradedb import Gradedb
from schema import *

In [1]:
%load_ext sql
%sql sqlite:///gradedb.db

In [14]:
%%sql
SELECT *
  FROM Assignment

 * sqlite:///gradedb.db
Done.

[(1, 'S0416410', 1),
 (2, 'S0225853', 2),
 (3, 'S1961057', 3),
 (4, 'S2204697', 4),
 (5, 'S4587398', 5)]

In [15]:
%%sql
SELECT *
  FROM Student

 * sqlite:///gradedb.db
Done.

[('S0416410', 'Marjorie Steele', '0416410@vuw.leidenuniv.nl'),
 ('S0225853', 'James Morse', '0225853@vuw.leidenuniv.nl'),
 ('S1961057', 'Dominic Robinson', '1961057@vuw.leidenuniv.nl'),
 ('S2204697', 'Diana Brown', '2204697@vuw.leidenuniv.nl'),
 ('S4587398', 'Mary Bakley', '4587398@vuw.leidenuniv.nl')]

In [16]:
%%sql
SELECT *
  FROM Question

 * sqlite:///gradedb.db
Done.

[(1, 'Question 1', 'Over here-remain night-key guariba ipes soliloquy?'),
 (2, 'Question 2', 'Calculate hedge-shrew sundogs choriogonadotropin octad Jacobean?'),
 (3, 'Question 3', 'Calculate treacher nautic bugbears flush-decked catheterisations?'),
 (4, 'Question 4', 'Over well-meaningly eccentric-strap beautes agflation mountainslope?'),
 (5, 'Question 5', 'Over kurus ramshackly Ndongo pupipara streptavidin?'),
 (6, 'Question 6', 'How war-hammer Wolff sausagemeat metronomically cognacy?'),
 (7, 'Question 7', 'Over impurities thiosulphates gâteaux photozincographic Flevoland?'),
 (8, 'Question 8', 'Calculate selva homeloan troused hulas water-bells?'),
 (9, 'Question 9', 'Calculate sororal ARVIN Pekingese villified enveigle?'),
 (10, 'Question 10', 'How vintaged unsweetens tammies trub Noor?'),
 (11, 'Question 11', 'Where theopneustic unhelmeted nullify outspelled autoantibodies?'),
 (12, 'Question 12', 'Where wander-year undersigns speak-easy homeboys gelato?'),
 (13, 'Question 13', 'Over twich question devourment unslept unprohibited?'),
 (14, 'Question 14', 'Which emptiness flopper cardiology mangue mouter?'),
 (15, 'Question 15', 'How estranger propogating time-line spaceport BAF?')]

In [17]:
  
%%sql
SELECT *
  FROM Answers

 * sqlite:///gradedb.db
Done.

[(1, 'Given Nagorno-Karabakh Khachaturian long-playing araneida elective bedsitters intuitional plinth.', 6, 2),
 (2, 'Given UMTS γ-rays known portobello unsew avocations cabinetry obliterated.', 6, 4),
 (3, 'Given glamourie undistracted sealife depotentiate tarradiddle spencers invigilates droppings.', 7, 2),
 (4, 'To calculate hopsack entryless teamster tetrahydrozoline hassocks unswathing Mosby thrillful.', 6, 4),
 (5, 'Because surface-velocity rigorous trippers transamination Japanophobia paterfamiliar playlists curtilages.', 3, 3)]

In [19]:
  
%%sql
SELECT *
  FROM Task

 * sqlite:///gradedb.db
Done.

[(1, 'Task 688', 'This is task 688, there are multiple questions you need answer.'),
 (2, 'Task 405', 'This is task 405, there are multiple questions you need answer.'),
 (3, 'Task 871', 'This is task 871, there are multiple questions you need answer.'),
 (4, 'Task 980', 'This is task 980, there are multiple questions you need answer.'),
 (5, 'Task 913', 'This is task 913, there are multiple questions you need answer.')]

In [20]:
  
%%sql
SELECT *
  FROM Task_question

 * sqlite:///gradedb.db
Done.

[(1, 1, 5),
 (2, 1, 8),
 (3, 1, 1),
 (4, 2, 10),
 (5, 2, 7),
 (6, 2, 6),
 (7, 3, 3),
 (8, 3, 2),
 (9, 3, 10),
 (10, 4, 15),
 (11, 4, 6),
 (12, 4, 11),
 (13, 5, 13),
 (14, 5, 5),
 (15, 5, 1)]

In [21]:
%%sql
SELECT *
  FROM Submission

 * sqlite:///gradedb.db
Done.

[(1, 1), (2, 2), (3, 3), (4, 4), (5, 5)]

In [22]:
%%sql
SELECT *
  FROM Evaluation

 * sqlite:///gradedb.db
Done.

[(1, 1), (2, 2), (3, 3), (4, 4), (5, 5)]

In [23]:
%%sql
SELECT *
  FROM EvaluationRequest

 * sqlite:///gradedb.db
Done.

[(1, 3), (2, 4), (3, 2), (4, 5), (5, 1)]

In [24]:
  
%%sql
SELECT *
  FROM EvaluationFinished

 * sqlite:///gradedb.db
Done.

[]

In [25]:
%%sql
SELECT *
  FROM Scores

 * sqlite:///gradedb.db
Done.

[(1, 1, 5, 1), (2, 9, 2, 2), (3, 7, 1, 3)]